GIT- распределенная система контроля версий

это система для отслеживания и ведения истории изменений ваших файлов или проектаю

репозиторий это хранилище ващих файлов которые вы отслеживаете с помошью гита и их изменений.

команды git 

git init - создает новый git репозиторий локально на вашем пк, в той директории где вы запускаете 
эту команду

git add -  когда мы создаем и изменяем файлы , то при помощи git add мы загружаем все изменения в промежуточное место хранения 

git add . - сохранит все в текущей директории 

git commit - коммитит и сохроняет все изменения в репозитории фиксируя как новая версия  

git commit -m '<comment>'

git remote add <название подключения> <ссылка на репозиторий>- связывает локальный репозиторий и серверный (гидхаб) [git remote add origin <url>]	

git push- после коммита изменений при помощи этой комманды мы отпровляем наши изменения в файлах на удаленный репозиторийж.

git push <origin> <главная ветка> 
 
git pull 

hi nigga 
